tap "blacktop/tap"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Stricter gofmt
brew "gofumpt"
# Like cURL, but for gRPC
brew "grpcurl"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Simple terminal UI for git commands
brew "lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Blazingly fast interpolated LUT generator and applicator for color palettes
brew "lutgen"
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@21"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Git-integrated backup tool for macOS and Linux devs
brew "shallow-backup"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Terminal multiplexer
brew "tmux"
# Find and verify credentials
brew "trufflehog"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# iOS App Store alternative
cask "altserver"
# Tools for building Android applications
cask "android-studio"
# Universal chat app powered by Matrix
cask "beeper"
# Display management tool
cask "betterdisplay"
# Compare files and folders
cask "beyond-compare@4"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# C and C++ IDE
cask "clion"
# Node-based image, video and audio generator
cask "comfyui"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Window peeking utility app
cask "dockdoor"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Utility for customizing which browser to start
cask "finicky"
# Hybrid IDE and text editor
cask "fleet"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Git client focusing on productivity
cask "gitkraken"
# CLI for GitKraken
cask "gitkraken-cli"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Download manager
cask "jdownloader"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Audio tagger focusing on efficiency
cask "kid3"
# Find and download song lyrics
cask "lyricsfinder"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Get up and running with large language models locally
cask "ollama-app"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Home media server
cask "plex-media-server"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Rust IDE
cask "rustrover"
# Digital design and prototyping platform
cask "sketch"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Macro remote control
cask "touch-portal"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Actions", id: 1586435171
mas "Amphetamine", id: 937984704
mas "Bandwidth+", id: 490461369
mas "CleanMyMac", id: 1339170533
mas "Cloud Battery", id: 1481005137
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Draw Things", id: 6444050820
mas "Equinox", id: 1591510203
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Mail Signature", id: 1595342317
mas "Messenger", id: 1480068668
mas "Mic Drop", id: 1489816366
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Prime Video", id: 545519333
mas "Raycast Companion", id: 6738274497
mas "RetroArch", id: 6499539433
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "SmartDNSProxy", id: 1471096079
mas "TabDirector", id: 6502719125
mas "Tag Editor 2", id: 984278082
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Wallpaper Play", id: 1638457121
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
vscode "bmewburn.vscode-intelephense-client"
vscode "davidanson.vscode-markdownlint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ionide.ionide-fsharp"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jdinhlife.gruvbox"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
